import math                              # Під'єднання бібліотеки математичних функцій

x=float(input("Enter number 0<=x<=2: ")) # Введення змінної для числа 0<=x<=2
if (x<=2) and (x>=0):

    a=(x*x-1)/2                              # Змінна першого значення у виразі
    b=(2*x*x-1)/3                            # Змінна другого значення у виразі
    rez=abs(a-b)                             # Змінна різниці двох послідовних значень у виразі
    s=a+b                                    # Змінна cуми двох послідовних значень
    i=3                                      # Змінна лічильник для задання циклу
    e=pow(10,-5)                             # Змінна точності обчислення
    while e<rez:                             # Доки точність менша ніж різниця двох послідовних чисел виконуємо тіло циклу
        d=pow(2,i-1)                         # Змінна для збереження значення двійки піднесеної до степеня і-1
        fact=math.factorial(d)               # Змінна для визначення факторіалу
        c=(i*x*x-1)/(1+fact)                 # i-те значення у виразі
        rez=abs(c-b)                           
        i=i+1
        s=s+c                                # Збільшення суми на і-тий елемент
        b=c
    print("The sum of all elements to the nearest 10^(-5): %.6f" % (s))  # Виведення суми всіх послідовних значень з точністю до 10^(-5)
else:
    print("Don't correct data")
